#coding:utf-8

import random

token = "489666269:AAEMkff3016XcKNJwO2fRLPX6Us0jNIVZ2M"


help_message = "Хелпа подьехала братан \n /help - покажет тебе хелпу \n - Пиши 'Расписание' или 'пары на завтра' чтобы посмотрет расписание \n - Чтобы пользоваться поиском гугла пиши в чат @thesearchbot и текст который хочешь загуглить(через пробел) \n - Чтобы не засорять чат, хелпа и вычисления выводятся в личный диалог"

#------------------------------------------------------------------------------

jeldak = ["Желдаков", "Желдак", "желдаков", "желдак", "желд", "Желд"]
jeldak_message = "Желдаков А.А. : 'ТИХА!'"

#------------------------------------------------------------------------------

sticker_pack_ids = [
                    'CAADAgADAgADQoCoDU0yJtUYSE8LAg',   #ids of stickers
                    'CAADAgADAwADQoCoDTjIiv8RfOJDAg',
                    'CAADAgADBQADQoCoDWqRtmtkRFxPAg',
                    'CAADAgADBAADQoCoDbxuVQgzF644Ag',
                    'CAADAgADCQADQoCoDUR6dF_3q1K3Ag',
                    'CAADAgADCAADQoCoDRmICTnCwXx0Ag',
                    'CAADAgADBwADQoCoDbaOnycuGphiAg',
                    'CAADAgADBgADQoCoDYTbqlWSwotVAg',
                    'CAADAgADCgADQoCoDeBn8jJdvB4FAg',
                    'CAADAgADCwADQoCoDXLIIaZORmjNAg',
                    'CAADAgADDAADQoCoDUahtIwhCnw4Ag',
                    'CAADAgADDQADQoCoDWk2ugpC0BY7Ag',
                    'CAADAgADEQADQoCoDXNiKfUPIm49Ag',
                    'CAADAgADEAADQoCoDXCApE4KgYmJAg',
                    'CAADAgADDwADQoCoDcJTkWp0QSVOAg',
                    'CAADAgADDgADQoCoDZbSGIHEO-tZAg',
                    'CAADAgADEgADQoCoDVlUTlrr7aHvAg',
                    'CAADAgADEwADQoCoDUFfsKRaHMQ_Ag',
                    'CAADAgADFQADQoCoDTUYihS9XbDfAg',
                    'CAADAgADFgADQoCoDbQn8KLMyLxdAg',
                    'CAADAgADGgADQoCoDS2TToZq9gKvAg',
                    'CAADAgADGQADQoCoDfInAlq3BnubAg',
                    'CAADAgADGAADQoCoDcbxLJixOvvkAg',
                    'CAADAgADFwADQoCoDY8hnu4AAUTIyQI',
                    'CAADAgADGwADQoCoDVyHQhjw1KuFAg'
                    ]

#------------------------------------------------------------------------------

shedule_ask = ['какие завтра пары ?','какие завтра пары?',
               'есть расписание ?','есть расписание?'
               "расписание", "киньте расписание",
               "розклад", "киньте розклад",
               "что у нас завтра?", "что у нас завтра ?",
               "какие завтра пары", "расписание",
               "какие пары завтра", "завтра какие пары",
               "что завтра?", "что завтра ?", "что завтра",
               "які завтра пари", "які завтра пари?", "які завтра пари ?",
               "що завтра?", "що завтра ?", "що завтра", "пары на завтра",
               "киньте расписание плз", '/tomorrow'
               ]

wdays = ('Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun')


shedule = {
    '1t' : {
            'Mon': {   'desc': 'Понедельник 1 неделя',
                       1: '1. ------',
                       2: '2. ------',
                       3: '3. ------',
                       4: '4. ------',
                       5: '5. ------',
                       6: '6. ------'},

            'Tue': {    'desc': 'Вторник  1 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Wed': {    'desc': 'Среда 1 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Thu': {    'desc': 'Четверг 1 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Fri':   {  'desc': 'Пятница 1 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},
            'Sat':   {  'desc': 'Суббота 1 недели, пар нет',
                        },
            'Sun':   {  'desc': 'Пары в воскресенье ????',
                        }
            },

    '2t':  {
            'Mon': {   'desc': 'Понедельник 2 неделя',
                       1: '1. ------',
                       2: '2. ------',
                       3: '3. ------',
                       4: '4. ------',
                       5: '5. ------',
                       6: '6. ------'},

            'Tue': {    'desc': 'Вторник  2 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Wed': {    'desc': 'Среда 2 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Thu': {    'desc': 'Четверг 2 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},

            'Fri':   {  'desc': 'Пятница 2 неделя',
                        1: '1. ------',
                        2: '2. ------',
                        3: '3. ------',
                        4: '4. ------',
                        5: '5. ------',
                        6: '6. ------'},
            'Sat':   {  'desc': 'Суббота 1 недели, пар нет',
                        },
            'Sun':   {  'desc': 'Пары в воскресенье ????',
                        }
            }
}

#------------------------------------------------------------------------------